jiro-aqua/nrf52-ota-example/application/main.c
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                            /**< Handle of the current connection. */
static void advertising_start(bool erase_bonds);                                    /**< Forward declaration of advertising start function */

#define AB_BLE_OBSERVER_PRIO 2

#define AB_BLE_SERVICE_DEF(_name)                                                                 \
static ab_ble_t _name;                                                                            \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                                                               \
                     AB_BLE_OBSERVER_PRIO,                                                    \
                     ab_ble_on_ble_evt, &_name)

typedef void (*ab_ble_command_write_handler_t) (const uint8_t *commands, uint8_t length);
typedef void (*ab_ble_tx_complete_handler_t)(void);

typedef struct ab_ble_s
{
    uint16_t                    service_handle;
    ble_gatts_char_handles_t    command_char_handles;
    ble_gatts_char_handles_t    response_char_handles;
    ble_gatts_char_handles_t    data_char_handles;
    uint8_t                     uuid_type;
    ab_ble_command_write_handler_t command_write_handler;
    ab_ble_tx_complete_handler_t tx_complete_handler;
} ab_ble_t; 

void ab_ble_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);

AB_BLE_SERVICE_DEF(m_abs);

// UUID for AquaBlue Service
// 8154ef7d-469b-471e-b071-2cfe62d43f3a

#define AB_BLE_UUID_BASE        {0x3a, 0x3f, 0xd4, 0x62, 0xfe, 0x2c, 0x71, 0xb0, \
                                 0x1e, 0x47, 0x96, 0x46, 0x00, 0x00, 0x54, 0x81}
#define AB_BLE_UUID_SERVICE       0xef7d
#define AB_BLE_UUID_COMMAND_CHAR  0xef70
#define AB_BLE_UUID_RESPONSE_CHAR 0xef71
#define AB_BLE_UUID_DATA_CHAR   0xef72
#define AB_BLE_MAX_DATA_LEN    (NRF_SDH_BLE_GATT_MAX_MTU_SIZE - 1 - 2)

//static uint8_t uuid_type;
//static uint16_t service_handle;
//static ble_gatts_char_handles_t    command_char_handles;
//static ble_gatts_char_handles_t    response_char_handles;
//static ble_gatts_char_handles_t    data_char_handles;

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = {{AB_BLE_UUID_SERVICE, 0}};


static void on_write(ab_ble_t * p_abs, ble_evt_t const * p_ble_evt)
{
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

    if (p_evt_write->handle == p_abs->command_char_handles.value_handle)
    {
        p_abs->command_write_handler(p_evt_write->data , p_evt_write->len );
    }
}


void ab_ble_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    ab_ble_t * p_abs = (ab_ble_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_WRITE:
            on_write(p_abs, p_ble_evt);
            break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
//            NRF_LOG_INFO("send completed.");
            p_abs->tx_complete_handler();
            break;

       default:
            // No implementation needed.
            break;
    }
}


/**@brief Handler for shutdown preparation.
 *
 * @details During shutdown procedures, this function will be called at a 1 second interval
 *          untill the function returns true. When the function returns true, it means that the
 *          app is ready to reset to DFU mode.
 *
 * @param[in]   event   Power manager event.
 *
 * @retval  True if shutdown is allowed by this power manager handler, otherwise false.
 */
static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            NRF_LOG_INFO("Power management wants to reset to DFU mode.");
            // YOUR_JOB: Get ready to reset into DFU mode
            //
            // If you aren't finished with any ongoing tasks, return "false" to
            // signal to the system that reset is impossible at this stage.
            //
            // Here is an example using a variable to delay resetting the device.
            //
            // if (!m_ready_for_reset)
            // {
            //      return false;
            // }
            // else
            //{
            //
            //    // Device ready to enter
            //    uint32_t err_code;
            //    err_code = sd_softdevice_disable();
            //    APP_ERROR_CHECK(err_code);
            //    err_code = app_timer_stop_all();
            //    APP_ERROR_CHECK(err_code);
            //}
            break;

        default:
            // YOUR_JOB: Implement any of the other events available from the power management module:
            //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
            //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
            //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
            return true;
    }

    NRF_LOG_INFO("Power management allowed to reset to DFU mode.");
    return true;
}

//lint -esym(528, m_app_shutdown_handler)
/**@brief Register application shutdown handler with priority 0.
 */
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);


static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context)
{
    if (state == NRF_SDH_EVT_STATE_DISABLED)
    {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
{
    .handler = buttonless_dfu_sdh_state_observer,
};


static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}


static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_WARNING("Failed to disconnect connection. Connection handle: %d Error: %d", conn_handle, err_code);
    }
    else
    {
        NRF_LOG_DEBUG("Disconnected connection handle %d", conn_handle);
    }
}



// YOUR_JOB: Update this code if you want to do anything given a DFU event (optional).
/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event)
    {
        case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE:
        {
            NRF_LOG_INFO("Device is preparing to enter bootloader mode.");

            // Prevent device from advertising on disconnect.
            ble_adv_modes_config_t config;
            advertising_config_get(&config);
            config.ble_adv_on_disconnect_disabled = true;
            ble_advertising_modes_config_set(&m_advertising, &config);

            // Disconnect all other bonded devices that currently are connected.
            // This is required to receive a service changed indication
            // on bootup after a successful (or aborted) Device Firmware Update.
            uint32_t conn_count = ble_conn_state_for_each_connected(disconnect, NULL);
            NRF_LOG_INFO("Disconnected %d links.", conn_count);
            break;
        }

        case BLE_DFU_EVT_BOOTLOADER_ENTER:
            // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
            //           by delaying reset by reporting false in app_shutdown_handler
            NRF_LOG_INFO("Device will enter bootloader mode.");
            break;

        case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
            NRF_LOG_ERROR("Request to enter bootloader mode failed asynchroneously.");
            // YOUR_JOB: Take corrective measures to resolve the issue
            //           like calling APP_ERROR_CHECK to reset the device.
            break;

